epay/epayapi/docs/test_di_carico/V1/SYN_07_Servizio_pagamentoIUV/SYN_07_pagamentoIUV.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="API Rest: primitiva pagamento IUV" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Creazione Dati Riferimento Pagamenti" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Caricamento dati Chiamante Esterno" enabled="true">
          <stringProp name="TestPlan.comments">Caricamento del file CSV ChiamanteEsternoConfigurationData.csv contenente i dati del chiamante esterno</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">C:/progetti/test_rdi_32/progettiJMeter/performance/api-rest/V1/SYN_07_Servizio_pagamentoIUV/ChiamanteEsternoConfigurationData.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.group</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">codiceChiamante,pwd,prefissoIdentificativoPagamento</stringProp>
        </CSVDataSet>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Configurazione Connessione JDBC EPAY" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="dbURL" elementType="Argument">
              <stringProp name="Argument.name">dbURL</stringProp>
              <stringProp name="Argument.value">jdbc:postgresql://10.138.154.6:10510/TEST</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="dbUsr" elementType="Argument">
              <stringProp name="Argument.name">dbUsr</stringProp>
              <stringProp name="Argument.value">epay</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="dbPWD" elementType="Argument">
              <stringProp name="Argument.name">dbPWD</stringProp>
              <stringProp name="Argument.value">mypass</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
          <stringProp name="TestPlan.comments">Impostazione dei parametri di connessione al database EPAY</stringProp>
        </Arguments>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Connessione DB EPAY" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">EPAY_JDBC_POOL</stringProp>
          <stringProp name="dbUrl">${dbURL}</stringProp>
          <stringProp name="driver">org.postgresql.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">${dbPWD}</stringProp>
          <stringProp name="poolMax">0</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">${dbUsr}</stringProp>
          <stringProp name="TestPlan.comments">Creazioni del pool di connessioni verso il db EPAY</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request Caricamento Dati Pagamenti" enabled="true">
          <stringProp name="dataSource">EPAY_JDBC_POOL</stringProp>
          <stringProp name="query">select
	&apos;${codiceChiamante}&apos; as &quot;codice_chiamante&quot;,
	&apos;${pwd}&apos; as &quot;pwd&quot;,
	tracciabilitaChiamanteEsterno.iuv,
	ente.codice_fiscale,
	tracciabilitaChiamanteEsterno.identificativo_pagamento
from
	epay_t_tracciabilita_chiamante_esterno tracciabilitaChiamanteEsterno,
	epay_t_pagamento pagamento,
	--epay_t_anagrafica anagrafica,
	epay_t_enti ente,
	epay_t_tipo_pagamento tipoPagamento
where
	tracciabilitaChiamanteEsterno.codice_chiamante = &apos;${codiceChiamante}&apos; and
	tracciabilitaChiamanteEsterno.identificativo_pagamento like &apos;${prefissoIdentificativoPagamento}%&apos; and
	pagamento.iuv_numero_avviso = tracciabilitaChiamanteEsterno.iuv and
	pagamento.id_stato_corrente in (0) and
	--anagrafica.id_anagrafica = pagamento.id_anagrafica_pagatore and
	--anagrafica.codice_fiscale = tracciabilitaChiamanteEsterno.codice_fiscale and 
	ente.id_ente = tipopagamento.id_ente and
	tipopagamento.id_tipo_pagamento = pagamento.id_tipo_pagamento 
limit 100</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
          <stringProp name="resultVariable">paymentsData</stringProp>
          <stringProp name="TestPlan.comments">Lettura dal DB EPAY dei pagamenti</stringProp>
        </JDBCSampler>
        <hashTree>
          <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="BeanShell Assertion" enabled="true">
            <stringProp name="BeanShellAssertion.query">if (!ResponseCode.equals(&quot;200&quot;)) {

	FailureMessage = &quot;!!!!!!!!!!! CONNESSIONE AL DATABASE FALLITA !!!!!!!!!!!&quot;;
	Failure = true;	
	prev.setStopThread(true);
	
}</stringProp>
            <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
          </BeanShellAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor Creazione del file PaymentsData.csv" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="parameters">paymentsData</stringProp>
            <stringProp name="script">import java.math.BigInteger;
import java.io.FileWriter;
import java.util.Arrays;
import java.io.Writer;
import java.util.List;

import org.apache.jmeter.services.FileServer;

setStrictJava (true);

String[] columnNames = {&quot;codice_chiamante&quot;,&quot;pwd&quot;,&quot;iuv&quot;,&quot;codice_fiscale&quot;,&quot;identificativo_pagamento&quot;};

ArrayList result = vars.getObject(&quot;paymentsData&quot;);
StringBuilder sbData = new StringBuilder();
if((result!=null)&amp;&amp;(result.size() &gt; 0)){
	for(HashMap row:result){
		
		if(sbData.length()&gt;0){
			sbData.append(System.getProperty(&quot;line.separator&quot;));
		}
	
		for(int i=0;i&lt;columnNames.length;i++){
	
			if(i&gt;0){
				sbData.append(&quot;,&quot;);
			}
			sbData.append(&quot;\&quot;&quot;).append(row.get(columnNames[i])).append(&quot;\&quot;&quot;);	
		}
	}

	
	String csvFileName = FileServer.getFileServer().getBaseDir() + File.separator + &quot;PaymentsData.csv&quot;;
	FileWriter fileWriter = new FileWriter(csvFileName, false);
	
	fileWriter.write(sbData.toString());
	
	fileWriter.flush();
	fileWriter.close();
	
}</stringProp>
            <stringProp name="scriptLanguage">java</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group Esecuzione Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Caricamento Dati Pagamenti" enabled="true">
          <stringProp name="TestPlan.comments">Caricamento del file PaymentsData.csv contenete i dati dei pagamenti</stringProp>
          <stringProp name="filename">C:/progetti/test_rdi_32/progettiJMeter/performance/api-rest/V1/SYN_07_Servizio_pagamentoIUV/PaymentsData.csv</stringProp>
          <stringProp name="variableNames">codiceChiamante,pwd,iuv,codiceFiscale,identificativoPagamento</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Caricamento Dati di Connessione Servizio REST" enabled="true">
          <stringProp name="TestPlan.comments">Caricamento dell file CSV contenente i parametri di connessione al servizio REST</stringProp>
          <stringProp name="filename">C:/progetti/test_rdi_32/progettiJMeter/performance/api-rest/V1/SYN_07_Servizio_pagamentoIUV/RESTConnectionConfigurationData.csv</stringProp>
          <stringProp name="variableNames">protocol,host,port,resource,method</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request Chiamata Servizio REST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
          <stringProp name="HTTPSampler.path">${resource}organizations/${codiceFiscale}/debtpositions/${iuv}/payment</stringProp>
          <stringProp name="HTTPSampler.method">${method}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">Chiamata al servizio REST per l&apos;attivazione del pagamento dello IUV</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager  Impostazione Basic Authentication" enabled="true">
            <collectionProp name="AuthManager.auth_list">
              <elementProp name="" elementType="Authorization">
                <stringProp name="Authorization.username">${codiceChiamante}</stringProp>
                <stringProp name="Authorization.password">${pwd}</stringProp>
              </elementProp>
            </collectionProp>
            <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
          </AuthManager>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager  Impostazione Content-Type" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Users\epayuser1\Desktop\modello3\summaryResultTree.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Users\epayuser1\Desktop\modello3\summaryReport.csv</stringProp>
        <boolProp name="useGroupName">true</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Users\epayuser1\Desktop\modello3\summaryAggregate.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>